{"data":{"markdownRemark":{"html":"<p><a href=\"/?p=403\">Read this article in english</a></p>\n<p><a href=\"https://www.npmjs.com/package/generator-oss-component\">Ir al componente en npm</a></p>\n<p>Hace unos meses con el equipo en Free All Media empezamos a construir un proyecto javascript que rapidamente fue creciendo en lineas de codigo y en lo que en ese momento llamabamos componentes, pero que consistia en una coleccion de carpetas con archivos javascript en ellas. Teniamos la certidumbre al iniciar que <strong>ibamos a componentizar la aplicacion</strong> en algun momento, <strong>pero todavia no sabiamos cuando</strong> esto iba a ser apoyado por las prioridades del negocio.</p>\n<p>Luego de un tiempo, llego el momento de crear un nuevo set de servicios, que tenian componentes en comun con el set de servicios anterior. Entonces fue donde ocurrio el suceso: la <strong>necesidad de compartir componentes con al menos un proyecto</strong>.</p>\n<p>En ese momento se nos presento un problema clasico ingenieril de eficacia y eficiencia. Teniamos alrededor de 15 componentes distintos, y sabiamos que el mejor camino para tomar era el de hacer un componente distinto en cada uno de ellos en lugar de acoplar sus responsabilidades y hacer componentes “magicos”. Siempre procuramos intentar ir por el mejor camino que podemos visualizar, entonces no dudamos en ir por alli. <strong>Pero el negocio no estaba tan contento de gastar tanto tiempo en crear 15 componentes</strong> en lugar de 1 por una simple cuestion de orgullo profesional (con todas las garantias de calidad que un componente necesita para estar a la altura del resto de los componentes de la organizacion, que mas adelante detallo).</p>\n<p>Hablando en numeros, <strong>cada componente manualmente tardaria en inicializarse varias horas</strong>, dependiendo la funcionalidad del mismo. Fue entonces que negociamos con el negocio y <strong>decidimos hacer un generador de componentes</strong> en lugar de hacerlos individualmente, con el objetivo de optimizar por completo el tiempo de desarrollo de los patrones que se repetian.</p>\n<p>Este generador tiene la responsabilidad de inicializar un componente open source con una serie de caracteristicas deseables para los mismos:</p>\n<ul>\n<li>Un <strong>readme acorde</strong>, con las secciones y badges deseables</li>\n<li><strong>test coverage</strong></li>\n<li><strong>integracion continua</strong></li>\n<li><strong>calidad de codigo</strong></li>\n<li><strong>chequeo de dependencias</strong></li>\n<li><strong>tareas de compilado</strong></li>\n<li><strong>testeo de compatibilidad con browsers</strong></li>\n<li>compatibilidad con <strong>standards ECMA 6 y 5</strong></li>\n<li><strong>archivos de linting</strong></li>\n<li>muchos mas caracteristicas por venir: comportamiento mas complejo, mas integraciones y mejores preguntas</li>\n</ul>\n<p>Por suerte este componente <strong>dio rapidamente el resultado esperado</strong> y si bien esta en sus primeras versiones y con implementaciones muy particulares, nos es de muchisima utilidad, ya que <strong>en lugar de varias horas, ahora conseguimos un componente listo para utilizar y con un monton de caracteristicas de calidad listas en cuestion de minutos</strong>. Sabemos que la funcionalidad debido a la infinidad de opciones muy probablemente ira incrementandose con el tiempo y haciendo de este componente algo todavia mas completo y detallado aun.</p>\n<p>Desde luego el componente para generar componentes open source de calidad es tambien un componente open source generado por si mismo (se creo primero el componente open source basico y una vez lograda una mediana calidad del mismo, se “piso” consigo mismo). De hecho, <strong>para conseguir una mayor eficiencia a lo largo del tiempo con los componentes que se generen con este generador, se sugiere no tocar a mano los artefactos generados por el mismo</strong> (aunque hoy en dia es necesario para ciertas cosas en particular, en un futuro no deberia serlo).</p>\n<p>En definitiva creo que vale el aporte a la comunidad, y este post es una humilde sugerencia e invitacion para que lo adopten aquellos que quieran generar un componente con diversas caracteristicas adicionales tan solo contestando unas simples preguntas y sobre todo en unos pocos minutos.</p>\n<p>Como se utiliza?</p>\n<p><strong>Lo mas recomendado es</strong> <a href=\"https://github.com/FreeAllMedia/generator-oss-component/\" target=\"_blank\">leer el README</a> pero basicamente:</p>\n<ol>\n<li>creas tu repositorio en github</li>\n<li>lo linkeas en coveralls y en travis (basico para integracion continua y test coverage)</li>\n<li>si queres en las otras herramientas que se soportan en la aplicacion y que se deseen utilizar.</li>\n<li>(si no tenes yeoman instalado) npm install -g yo bower grunt-cli gulp</li>\n<li><em>npm install -g generator-oss-component</em></li>\n<li><em>inicialiar repo en github, ir a la carpeta y tipear: yo oss-component</em></li>\n<li>contestar las preguntas usando las credenciales si son necesarias para las posibles integraciones</li>\n<li>comenza a codear</li>\n<li>despues, ejecuta travis setup npm asi tu componente se autopublica</li>\n</ol>\n<p>Si no la encontras estas invitado a contrubuir desde luego, abriendo issues o enviando pull requests.</p>","frontmatter":{"date":"July 17, 2015","url":"/2015/07/17/crear-un-componente-javascript-y-open-source-de-calidad-en-minutos/","title":"Crear un componente javascript y open source de calidad en minutos","author":"nico","categories":["Español","Experiencias"],"tags":null,"type":null}}},"pageContext":{}}