{"data":{"markdownRemark":{"html":"<p><a href=\"/?p=174\" title=\"BW-REST\"><em>Para ver este artículo en español click aquí.</em></a></p>\n<p><strong>NOTE:</strong> TIBCO Announciates his support for REST Webservice finally from ActiveMatrix 6.0.</p>\n<p>When we are working with Tibco BusinessWorks it’s becoming more frequent the need to provide a REST API, just as the rest of the world. BW-REST goes beyond that and not only gives you the posibility to expose you services as a REST API, but also allows you to build an entire web application with HTML Templating, Cookies, Static resource routing, etc. It can be useful for several use cases like creating a rapid web application with latest javascript frameworks because you don’t want another layer on your app. Because you came from GI. Because you don’t want to spend more money on another developer. Because you don’t want to bring another error point to your application. Because you just need a little app to mantain the entities inside that project. Just a few cases. With BW-REST you can develop a complete web application like in the example: using backbone, require.js, jquery-ui, coffeescript, etc. It’s open source!</p>\n<p><a title=\"repo\" href=\"http://github.com/nicosommi/bw-rest\" target=\"_blank\">You can found it here http://github.com/nicosommi/bw-rest</a></p>\n<p>See the video here!</p>\n<p>Features v 0.1</p>\n<ul>\n<li>JADE templating support</li>\n<li>Controller support</li>\n<li>Project-relative paths</li>\n<li>Support for regular expressions</li>\n<li>Support query string and url parameters</li>\n<li>Static resource support (recursivelly)</li>\n<li>Built in implementation customizable by defaultvars</li>\n<li>Cookie support</li>\n<li>Multiple server on the same project/archive</li>\n</ul>\n<p>LICENSE: LGPL v3 ©2013 BW-REST</p>","frontmatter":{"date":"December 02, 2013","url":"/2013/12/02/bw-rest-2/","title":"BW-REST","author":"nico","categories":["English","Experiences","Integration","Technology"],"tags":null,"type":null}}},"pageContext":{}}